DataProcessors/LM_ОтмечаниеПосещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>LM_ОтмечаниеПосещений</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/LM_Урок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>LM_Урок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.LM_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.LM_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_СтатусыФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ученики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СписатьОплату</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Явка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LM_Тарифы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Часы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заметка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LM_Скидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LM_ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонусов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/LM_ГруппыОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>LM_ГруппыОбучения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПНВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВТВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СРВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧТВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПТВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СБВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВСВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/LM_ОтмечаниеПосещений/Forms/ФормаКартинки/Ext/Form/Module.bsl
&НаСервере
Процедура ПрименитьНаСервере()
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Отмечен", Истина);
	НайденныеСтроки = ТЗУроки.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого Стр из НайденныеСтроки Цикл
		
		ДокументИзменен = Ложь;
		
		Док = Стр.Урок.ПолучитьОбъект();
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Ученик", Стр.Ученик);
		Строки = Док.Ученики.НайтиСтроки(ПараметрыОтбора);
		
		Для Каждого Стр1 из Строки Цикл
			Если Стр1.Явка <> Стр.Отмечен Тогда
				Стр1.Явка = Стр.Отмечен;
				ДокументИзменен = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ДокументИзменен Тогда
			Попытка
				Док.Записать();
			Исключение
				Сообщить("Не удалось записать " +Стр.Урок+ " по причине: " +ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;    	
	
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	
	ПрименитьНаСервере();
	
	Состояние("Выполнено!");
	
	ОчиститьПоля();
	СформироватьВсе();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаНачала = ТекущаяДата()-(60*60*1);
	ДатаОкончания = ТекущаяДата()+(60*60*1);
	
	СформироватьВсе();
	
КонецПроцедуры

Процедура СформироватьВсе()
	
	ТекущееВремя = ТекущаяДата();
	
	ТЗУроки.Очистить();
	СчЦикла = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УрокУченики.Ссылка КАК Ссылка,
	|	УрокУченики.Ученик КАК Ученик,
	|	УрокУченики.Явка,
	|	УрокУченики.Ссылка.ГруппаОбучения КАК ГруппаОбучения,
	|	УрокУченики.Ссылка.ПредметОбучения КАК ПредметОбучения,
	|	УрокУченики.Ссылка.Дата КАК ВремяНачала,
	|	УрокУченики.Ссылка.КоличествоЧасов,
	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(УрокУченики.Ссылка.Дата, ЧАС, ЧАС(УрокУченики.Ссылка.КоличествоЧасов)), МИНУТА, МИНУТА(УрокУченики.Ссылка.КоличествоЧасов)) КАК ВремяОкончания,
	|	УрокУченики.Причина,
	|	УрокУченики.Заметка КАК Комментарий,
	|	УрокУченики.СписатьОплату КАК Списание
	|ИЗ
	|	Документ.LM_Урок.Ученики КАК УрокУченики
	|ГДЕ
	|	УрокУченики.Ссылка.Проведен = ИСТИНА
	|	И УрокУченики.Ссылка.Дата >= &ДатаНачала
	|	И УрокУченики.Ссылка.Дата <= &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВремяНачала,
	|	ГруппаОбучения,
	|	Ученик
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Сч = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сч = Сч + 1;
		НовСтрТЗ = ТЗУроки.Добавить();
		НовСтрТЗ.Урок 				= ВыборкаДетальныеЗаписи.Ссылка;
		НовСтрТЗ.Ученик 			= ВыборкаДетальныеЗаписи.Ученик;
		НовСтрТЗ.Отметка 			= ВыборкаДетальныеЗаписи.Явка;
		НовСтрТЗ.ГруппаОбучения 	= ВыборкаДетальныеЗаписи.ГруппаОбучения;
		НовСтрТЗ.ПредметОбучения 	= ВыборкаДетальныеЗаписи.ПредметОбучения;
		НовСтрТЗ.Причина 			= ВыборкаДетальныеЗаписи.Причина;
		НовСтрТЗ.Списание 			= ВыборкаДетальныеЗаписи.Списание;
		НовСтрТЗ.Комментарий 		= ВыборкаДетальныеЗаписи.Комментарий;
		НовСтрТЗ.Номер 				= Сч;
		НовСтрТЗ.ВремяНачала 		= ВыборкаДетальныеЗаписи.ВремяНачала;
		НовСтрТЗ.ВремяОкончания		= ВыборкаДетальныеЗаписи.ВремяОкончания;//ВыборкаДетальныеЗаписи.ВремяНачала-('00010101'-ВыборкаДетальныеЗаписи.КоличествоЧасов);
		
		Если (ВыборкаДетальныеЗаписи.ВремяНачала <= ТекущееВремя) и (ВыборкаДетальныеЗаписи.ВремяОкончания >= ТекущееВремя) Тогда
			НовСтрТЗ.Статус             = "Идёт";
		ИначеЕсли ВыборкаДетальныеЗаписи.ВремяОкончания < ТекущееВремя Тогда
			НовСтрТЗ.Статус             = "Прошёл";
		ИначеЕсли ВыборкаДетальныеЗаписи.ВремяОкончания > ТекущееВремя Тогда
			НовСтрТЗ.Статус             = "Будет";
		КонецЕсли;
		
	КонецЦикла;
	
	ОтобразитьУчеников();
	
КонецПроцедуры


Процедура ОтобразитьУчеников()	
	
	ГрОбуч = Справочники.LM_ГруппыОбучения.ПустаяСсылка(); 	
	
	Для Сч=1 по 6 Цикл				
		
		СчЦикла = СчЦикла + 1;
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номер", СчЦикла);
		НайденныеСтроки = ТЗУроки.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			СчЦикла = СчЦикла - 1;
			Прервать;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ГрОбуч) и ГрОбуч <> НайденныеСтроки[0].ГруппаОбучения Тогда
			СчЦикла = СчЦикла - 1;
			Прервать;
		КонецЕсли;
		
		ЗаголовокШапки = "Гр.: " +НайденныеСтроки[0].ГруппаОбучения+ " - Предмет: " +НайденныеСтроки[0].ПредметОбучения+ " - " +НайденныеСтроки[0].Урок;
		
		Попытка
			Элементы.Заголовок1.ЦветФонаЗаголовка 	= WebЦвета[НайденныеСтроки[0].ПредметОбучения.Цвет];
			Элементы.Заголовок1.ЦветФона 			= WebЦвета[НайденныеСтроки[0].ПредметОбучения.Цвет];
		Исключение
			Элементы.Заголовок1.ЦветФонаЗаголовка 	= WebЦвета["Белый"];
			Элементы.Заголовок1.ЦветФона 			= WebЦвета["Белый"];
		КонецПопытки;
		
		
		Если Сч = 1 Тогда
			ФизЛицо1ФИО 		= НайденныеСтроки[0].Ученик;
			ФизЛицо1Явка 		= НайденныеСтроки[0].Отметка;
			ФизЛицо1Причина 	= НайденныеСтроки[0].Причина;
			ФизЛицо1Комментарий = НайденныеСтроки[0].Комментарий;
			ФизЛицо1Списание 	= НайденныеСтроки[0].Списание;
			ФизЛицо1ФотоОбъект	= ПолучитьФото(НайденныеСтроки[0]); 
			ФизЛицо1НомерСтроки	= НайденныеСтроки[0].Номер;
			Элементы.ФизЛицо1.ЦветФона = WebЦвета.СеребристоСерый;
		ИначеЕсли Сч = 2 Тогда
			ФизЛицо2ФИО 		= НайденныеСтроки[0].Ученик;
			ФизЛицо2Явка 		= НайденныеСтроки[0].Отметка;
			ФизЛицо2Причина 	= НайденныеСтроки[0].Причина;
			ФизЛицо2Комментарий = НайденныеСтроки[0].Комментарий;
			ФизЛицо2Списание 	= НайденныеСтроки[0].Ученик;
			ФизЛицо2ФотоОбъект 	= ПолучитьФото(НайденныеСтроки[0]);
			ФизЛицо2НомерСтроки	= НайденныеСтроки[0].Номер;
			Элементы.ФизЛицо2.ЦветФона = WebЦвета.СеребристоСерый;
		ИначеЕсли Сч = 3 Тогда
			ФизЛицо3ФИО 		= НайденныеСтроки[0].Ученик;
			ФизЛицо3Явка 		= НайденныеСтроки[0].Отметка;
			ФизЛицо3Причина 	= НайденныеСтроки[0].Причина;
			ФизЛицо3Комментарий = НайденныеСтроки[0].Комментарий;
			ФизЛицо3Списание 	= НайденныеСтроки[0].Ученик;
			ФизЛицо3ФотоОбъект 	= ПолучитьФото(НайденныеСтроки[0]);
			ФизЛицо3НомерСтроки	= НайденныеСтроки[0].Номер;
			Элементы.ФизЛицо3.ЦветФона = WebЦвета.СеребристоСерый;
		ИначеЕсли Сч = 4 Тогда
			ФизЛицо4ФИО 		= НайденныеСтроки[0].Ученик;
			ФизЛицо4Явка 		= НайденныеСтроки[0].Отметка;
			ФизЛицо4Причина 	= НайденныеСтроки[0].Причина;
			ФизЛицо4Комментарий = НайденныеСтроки[0].Комментарий;
			ФизЛицо4Списание 	= НайденныеСтроки[0].Ученик;
			ФизЛицо4ФотоОбъект 	= ПолучитьФото(НайденныеСтроки[0]); 
			ФизЛицо4НомерСтроки	= НайденныеСтроки[0].Номер;
			Элементы.ФизЛицо4.ЦветФона = WebЦвета.СеребристоСерый;
		ИначеЕсли Сч = 5 Тогда
			ФизЛицо5ФИО 		= НайденныеСтроки[0].Ученик;
			ФизЛицо5Явка 		= НайденныеСтроки[0].Отметка;
			ФизЛицо5Причина 	= НайденныеСтроки[0].Причина;
			ФизЛицо5Комментарий = НайденныеСтроки[0].Комментарий;
			ФизЛицо5Списание 	= НайденныеСтроки[0].Ученик;
			ФизЛицо5ФотоОбъект 	= ПолучитьФото(НайденныеСтроки[0]);
			ФизЛицо5НомерСтроки	= НайденныеСтроки[0].Номер;
			Элементы.ФизЛицо5.ЦветФона = WebЦвета.СеребристоСерый;
		ИначеЕсли Сч = 6 Тогда
			ФизЛицо6ФИО 		= НайденныеСтроки[0].Ученик;
			ФизЛицо6Явка 		= НайденныеСтроки[0].Отметка;
			ФизЛицо6Причина 	= НайденныеСтроки[0].Причина;
			ФизЛицо6Комментарий = НайденныеСтроки[0].Комментарий;
			ФизЛицо6Списание 	= НайденныеСтроки[0].Ученик;
			ФизЛицо6ФотоОбъект 	= ПолучитьФото(НайденныеСтроки[0]);
			ФизЛицо6НомерСтроки	= НайденныеСтроки[0].Номер;
			Элементы.ФизЛицо6.ЦветФона = WebЦвета.СеребристоСерый;
		КонецЕсли;
		
		Элементы["ФизЛицо"+Сч+"НомерСтроки"].Заголовок = Строка(НайденныеСтроки[0].Номер);
		
		Если НайденныеСтроки[0].Отмечен Тогда
			Элементы["ФизЛицо"+Сч].ЦветФона = WebЦвета.СветлоЗеленый;
		Иначе
			Элементы["ФизЛицо"+Сч].ЦветФона = WebЦвета.СеребристоСерый;
		КонецЕсли;
		
		ГрОбуч = НайденныеСтроки[0].ГруппаОбучения;
		
		Если Сч = 6 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры


Функция ПолучитьФото(Строки)
	
	Попытка
		Фото = ПоместитьВоВременноеХранилище(Строки.Ученик.Фото.Файл.Получить());
	Исключение
		Фото = "";
	КонецПопытки;
	
	Возврат Фото;
	
КонецФункции


&НаКлиенте
Процедура ЗавершитьРаботу(Команда)  	
	
	ЗавершитьРаботуСистемы(
	Ложь, // запрашивать возможность
	Ложь, // (необ.) перезапустить после завершения
	"" // (необ.) дополнительные параметры, если делается перезапуск
	);
	
КонецПроцедуры

&НаКлиенте
Процедура СледующаяСтрока(Команда)
	
	Если СчЦикла >= ТЗУроки.Количество() Тогда
		Возврат;
	КонецЕсли; 
	
	ОчиститьПоля();
	ОтобразитьУчеников();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоля()
	
	ЗаголовокШапки 	= "";
	
	ФизЛицо1ФИО 		= Неопределено;
	ФизЛицо1Явка 		= Ложь;
	ФизЛицо1Причина 	= "";
	ФизЛицо1Комментарий = "";
	ФизЛицо1Списание 	= Ложь;	
	ФизЛицо1ФотоОбъект 	= ""; 	
	ФизЛицо1НомерСтроки	= 0;                                                   
	Элементы.ФизЛицо1НомерСтроки.Заголовок = "";
	Элементы.ФизЛицо1.ЦветФона = WebЦвета.Белый;
	
	ФизЛицо2ФИО 		= Неопределено;
	ФизЛицо2Явка 		= Ложь;
	ФизЛицо2Причина 	= "";
	ФизЛицо2Комментарий = "";
	ФизЛицо2Списание 	= Ложь;
	ФизЛицо2ФотоОбъект 	= ""; 
	ФизЛицо2НомерСтроки	= 0;
	Элементы.ФизЛицо2НомерСтроки.Заголовок = "";
	Элементы.ФизЛицо2.ЦветФона = WebЦвета.Белый;
	
	ФизЛицо3ФИО 		= Неопределено;
	ФизЛицо3Явка 		= Ложь;
	ФизЛицо3Причина 	= "";
	ФизЛицо3Комментарий = "";
	ФизЛицо3Списание 	= Ложь;
	ФизЛицо3ФотоОбъект 	= ""; 
	ФизЛицо3НомерСтроки	= 0;
	Элементы.ФизЛицо3НомерСтроки.Заголовок = "";
	Элементы.ФизЛицо3.ЦветФона = WebЦвета.Белый;
	
	ФизЛицо4ФИО 		= Неопределено;
	ФизЛицо4Явка 		= Ложь;
	ФизЛицо4Причина 	= "";
	ФизЛицо4Комментарий = "";
	ФизЛицо4Списание 	= Ложь;
	ФизЛицо4ФотоОбъект 	= ""; 
	ФизЛицо4НомерСтроки	= 0;
	Элементы.ФизЛицо4НомерСтроки.Заголовок = "";
	Элементы.ФизЛицо4.ЦветФона = WebЦвета.Белый;
	
	ФизЛицо5ФИО 		= Неопределено;
	ФизЛицо5Явка 		= Ложь;
	ФизЛицо5Причина 	= "";
	ФизЛицо5Комментарий = "";
	ФизЛицо5Списание 	= Ложь;
	ФизЛицо5ФотоОбъект 	= ""; 
	ФизЛицо5НомерСтроки	= 0;
	Элементы.ФизЛицо5НомерСтроки.Заголовок = "";
	Элементы.ФизЛицо5.ЦветФона = WebЦвета.Белый;
	
	ФизЛицо6ФИО 		= Неопределено;
	ФизЛицо6Явка 		= Ложь;
	ФизЛицо6Причина 	= "";
	ФизЛицо6Комментарий = "";
	ФизЛицо6Списание 	= Ложь;
	ФизЛицо6ФотоОбъект 	= ""; 
	ФизЛицо6НомерСтроки	= 0;
	Элементы.ФизЛицо6НомерСтроки.Заголовок = "";
	Элементы.ФизЛицо6.ЦветФона = WebЦвета.Белый;
	
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущаяСтрока(Команда)
	
	СчЦикла = 0;
	ОчиститьПоля();
	ОтобразитьУчеников(); 	
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	ОчиститьПоля();
	СформироватьВсе();
КонецПроцедуры

&НаКлиенте
Процедура ФизЛицо1ФотоНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НазваниеПоляФормы = Лев(Элемент.Родитель.Имя,8)+"НомерСтроки";
	
	Если НЕ ЗначениеЗаполнено(Элемент.Родитель.ПодчиненныеЭлементы[НазваниеПоляФормы].Заголовок) Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.Родитель.ЦветФона = WebЦвета.СеребристоСерый Тогда
		Элемент.Родитель.ЦветФона = WebЦвета.СветлоЗеленый;
		ТЗУроки[Число(Элемент.Родитель.ПодчиненныеЭлементы[НазваниеПоляФормы].Заголовок)-1].Отмечен = Истина;
	Иначе
		Элемент.Родитель.ЦветФона = WebЦвета.СеребристоСерый;
		ТЗУроки[Число(Элемент.Родитель.ПодчиненныеЭлементы[НазваниеПоляФормы].Заголовок)-1].Отмечен = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЧасВперед(Команда)
	ДатаНачала 		= ДатаНачала + (60*60*1);
	ДатаОкончания 	= ДатаОкончания + (60*60*1);
	ОчиститьПоля();
	СформироватьВсе();
КонецПроцедуры

&НаКлиенте
Процедура ЧасНазад(Команда)
	ДатаНачала 		= ДатаНачала - (60*60*1);
	ДатаОкончания 	= ДатаОкончания - (60*60*1);
	ОчиститьПоля();
	СформироватьВсе();
КонецПроцедуры
